app/controllers/account/requests_controller.rb

  def create
    @request = Request.new(request_params)
    @request.user_id = current_user.id
    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("title", "description", "requesttype", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "asd"], ["description", "asd"], ["requesttype", "asd"], ["user_id", 1], ["created_at", "2015-04-21 05:07:36.810752"], ["updated_at", "2015-04-21 05:07:36.810752"]]

  def update
    respond_to do |format|
      if @request.update(request_params)
---
UPDATE "requests" SET "description" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["description", "Does anyone have a bike that i can borrow for the weekend?"], ["updated_at", "2015-04-22 00:54:31.436991"], ["id", 10]]

  def destroy
    @request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 1]]

    def set_own_request
      @request = Request.find_by_id_and_user_id(params[:id], current_user.id)
---
SELECT  "requests".* FROM "requests" WHERE "requests"."id" = ? AND "requests"."user_id" = ? LIMIT 1  [["id", 10], ["user_id", 2]]