app/controllers/account_controller.rb

SELECT "requests".* FROM "requests" WHERE "requests"."user_id" = ?  [["user_id", 1]]
---
  def index
    @requests = Request.where(user_id: current_user.id)