app/controllers/requests_controller.rb

  def reqtype
    @requestserv = Request.where("requesttype = '#{params[:request]}'")
---
SELECT "requests".* FROM "requests" WHERE (requesttype = 'service')