app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "image", "provider", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.find_or_create_from_auth_hash(auth_hash)